; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 928955 2 3 2 5 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	infrared1 - mode
	infrared0 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Star3 - direction
	Star1 - direction
	Star5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 infrared0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star3)
	(supports instrument2 infrared1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star1)
	(supports instrument4 infrared1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star3)
	(supports instrument5 infrared1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet6)
)
(:goal (and
	(pointing satellite0 Star1)
	(have_image Star5 infrared1)
	(have_image Planet6 infrared0)
	(have_image Planet7 infrared0)
	(have_image Star8 infrared1)
	(have_image Phenomenon9 infrared0)
	(have_image Phenomenon10 infrared0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
2. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 0 of 7
3. (turn_to satellite0 star1 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star1)
   goals met: 1 of 7
4. (turn_to satellite1 star1 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star1)
   goals met: 1 of 7
5. (calibrate satellite1 instrument5 star1)
   added: (calibrated instrument5)
   goals met: 1 of 7
6. (turn_to satellite0 star5 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star5)
   goals met: 0 of 7
7. (turn_to satellite1 star8 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star8)
   goals met: 0 of 7
8. (turn_to satellite0 star1 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star1)
   goals met: 1 of 7
9. (take_image satellite1 star8 instrument5 infrared1)
   added: (have_image star8 infrared1)
   goals met: 2 of 7
10. (turn_to satellite0 planet7 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet7)
   goals met: 1 of 7
11. (turn_to satellite1 star5 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star5)
   goals met: 1 of 7
12. (turn_to satellite0 star1 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star1)
   goals met: 2 of 7
13. (take_image satellite1 star5 instrument5 infrared1)
   added: (have_image star5 infrared1)
   goals met: 3 of 7
14. (turn_to satellite0 planet6 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet6)
   goals met: 2 of 7
15. (turn_to satellite1 planet7 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 planet7)
   goals met: 2 of 7
16. (turn_to satellite0 star1 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star1)
   goals met: 3 of 7
17. (take_image satellite1 planet7 instrument5 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 4 of 7
18. (turn_to satellite0 planet6 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet6)
   goals met: 3 of 7
19. (turn_to satellite1 phenomenon9 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 7
20. (turn_to satellite0 star1 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star1)
   goals met: 4 of 7
21. (take_image satellite1 phenomenon9 instrument5 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 5 of 7
22. (turn_to satellite0 planet6 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet6)
   goals met: 4 of 7
23. (turn_to satellite1 phenomenon10 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon10)
   goals met: 4 of 7
24. (turn_to satellite0 star1 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star1)
   goals met: 5 of 7
25. (take_image satellite1 phenomenon10 instrument5 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 6 of 7
26. (turn_to satellite1 planet6 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet6)
   goals met: 6 of 7
27. (take_image satellite1 planet6 instrument5 infrared0)
   added: (have_image planet6 infrared0)
   goals met: 7 of 7
